Revit 2025 API
ElectricalSystem.NeutralConductorsNumber Property
 The NeutralConductors Number of the Electrical System.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public int NeutralConductorsNumber { get; set; }
Public Property NeutralConductorsNumber As Integer
	Get
	Set
public:
property int NeutralConductorsNumber {
	int get ();
	void set (int value);
}
member NeutralConductorsNumber : int with get, set
Property Value
Int32
Exceptions
Exception | Condition
InvalidOperationException |  This property only available when System Type is Power!
Remarks
 This property is used to retrieve the NeutralConductors Number of the Electrical System.
See Also
Reference
ElectricalSystem Class
Autodesk.Revit.DB.Electrical Namespace